<?xml version="1.0" ?>
<net batch="1" name="mnist" version="4">
	<layers>
		<layer id="0" name="0" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>100</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="43" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="6" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>1</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="600"/>
				<biases offset="600" size="24"/>
			</blobs>
		</layer>
		<layer id="2" name="45" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>6</dim>
					<dim>28</dim>
					<dim>28</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>6</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="46" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="16" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>6</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>16</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</output>
			<blobs>
				<weights offset="624" size="9600"/>
				<biases offset="10224" size="64"/>
			</blobs>
		</layer>
		<layer id="4" name="48" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="floor" strides="2,2"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>16</dim>
					<dim>14</dim>
					<dim>14</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>16</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="49" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="5,5" output="120" pads_begin="2,2" pads_end="2,2" strides="1,1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>16</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>120</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10288" size="192000"/>
				<biases offset="202288" size="480"/>
			</blobs>
		</layer>
		<layer id="6" name="58" precision="FP32" type="Reshape">
			<data dim="100,5880"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>120</dim>
					<dim>7</dim>
					<dim>7</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>5880</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="59" precision="FP32" type="FullyConnected">
			<data alpha="0" beta="0" out-size="120"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>5880</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>120</dim>
				</port>
			</output>
			<blobs>
				<weights offset="202768" size="2822400"/>
				<biases offset="3025168" size="480"/>
			</blobs>
		</layer>
		<layer id="8" name="60" precision="FP32" type="Reshape">
			<data dim="100, 120, 1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Mul1_149/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3025648" size="480"/>
				<biases offset="3026128" size="480"/>
			</blobs>
		</layer>
		<layer id="10" name="62" precision="FP32" type="Reshape">
			<data dim="100, 120"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>120</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>120</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="63" precision="FP32" type="FullyConnected">
			<data alpha="0" beta="0" out-size="84"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>120</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>84</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3026608" size="40320"/>
				<biases offset="3066928" size="336"/>
			</blobs>
		</layer>
		<layer id="12" name="64" precision="FP32" type="Reshape">
			<data dim="100, 84, 1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>84</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Mul1_185/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>84</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>84</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3067264" size="336"/>
				<biases offset="3067600" size="336"/>
			</blobs>
		</layer>
		<layer id="14" name="66" precision="FP32" type="Reshape">
			<data dim="100, 84"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>84</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>84</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="67" precision="FP32" type="FullyConnected">
			<data alpha="0" beta="0" out-size="10"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>84</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>10</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3067936" size="3360"/>
				<biases offset="3071296" size="40"/>
			</blobs>
		</layer>
		<layer id="16" name="68" precision="FP32" type="Reshape">
			<data dim="100, 10, 1"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>10</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Mul1_176/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>100</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3071336" size="40"/>
				<biases offset="3071376" size="40"/>
			</blobs>
		</layer>
		<layer id="18" name="70" precision="FP32" type="Reshape">
			<data dim="100, 10"/>
			<input>
				<port id="0">
					<dim>100</dim>
					<dim>10</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>100</dim>
					<dim>10</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="3" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="1" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="3" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="1" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="3" to-layer="18" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="1.5.12.49d067a0"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_resnet_optimization value="False"/>
			<extensions value="DIR"/>
			<framework value="onnx"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/mnist.onnx"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_shape, model_name, output, scale"/>
		</cli_parameters>
	</meta_data>
</net>
